<?php

####################################################################################################
####################################################################################################
####################################################################################################
#
class _identify_
{
#
#protected static $info = null;
public static $info = null;
#
####################################################################################################
####################################################################################################
####################################################################################################
#
public static function identify ()
{
	// «агружаем или начинаем сессию дл€ посетител€, загружаем данные сессии,
	// отправл€ем посетителю cookie с id сессии (если это нова€ сесси€).
//	session_name(_config_::$session_cookie_name);
//	session_set_cookie_params(_config_::$session_cookie_lifetime, _config_::$session_cookie_path, _config_::$session_cookie_domain);
//	session_start();

		self::$info = $result = null;
		
	// ƒл€ пользовательской сессии читаем данные пользовател€ из базы.
	//!!!todo: дл€ скорости работы лучше сделать хранение данных в самой сессии,
	//!!!todo: и перечитывать их при операци€х изменени€. но мало ли что там помен€етс€ в базе,
	//!!!todo: и надо отразить пр€мо в процессе работы сессии.
	if (isset($_GET['auth']) && @$_SESSION['@id'] == 1)
	{
		$tmp = explode('|', $_GET['auth']);
		$id = $tmp[0];
		$encrypt_pwd = $tmp[1];

		// „итаем все пол€ из базы.
		$dat = _main_::query(null, "
			select	id
			from	`users`
			where	`id` = {1} and `encrypted_password` = {2}",
			$id, $encrypt_pwd);

		if ($dat)
		{
			$_SESSION['@id'] = array_shift($dat)['id'];
		}
	}

	if (isset($_SESSION['@id']))
	{
		// „итаем все пол€ из базы.
		$dat = _main_::query(null, "
			select	*
			from	`users`
			where	`id` = {1}",
			$_SESSION['@id']);

		// „истим от ненужных полей дл€ пущей паранойи (чтобы не засветить хеши в DOM-дампе).
		foreach ($dat as $idx => $row)
			unset($dat[$idx]['encrypted_password']);
		//!!!fix: когда пользователь стЄрт из базы (т.е. !count($visitor_info)), но его ид осталось в сессии,
		//!!!fix: мы его ниже игнорируем и считаем анонимом, Ќќ надо очистить сессию от user-переменных.

		$m = _main_::fetchModule('users');
		$m->data_parce($dat);

		self::$info = $result = array_shift($dat);
		
		$m = _main_::fetchModule('users/log');
		$m->log_request();
	} else
	{
		self::$info = $result = null;
	}


	return $result;
}
#
####################################################################################################
#
public static function field ($fieldname)
{
	return (is_array(self::$info) && array_key_exists($fieldname, self::$info)) ? self::$info[$fieldname] : null;
}
#
####################################################################################################
#
#
####################################################################################################
#
public static function check ()
{
	return (isset(self::$info) && isset(self::$info['id']));
}
public static function id ()
{
	return (isset(self::$info) && isset(self::$info['id'])) ? self::$info['id'] : null;
}
#
####################################################################################################
#
}
#
// ƒавид привет.
####################################################################################################
####################################################################################################
####################################################################################################
?>